rheoTool/tutorials/rheoEFoam/channelEDF/PowerLaw/PoissonBoltzmann/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-06;

vertices
(
  (0 0 0)
  (15 0 0)
  (15 15 0)
  (0 15 0)
  
  (0 0 10)
  (15 0 10)
  (15 15 10)
  (0 15 10)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 300 1) simpleGrading (1 .3 1)     
);

edges
(
);

boundary
(
     inlet
     {
      type cyclic;
      neighbourPatch  outlet;
      faces
      (
            (0 3 7 4)           
      );
    }
    
    walls
    {
        type wall;
        faces
        (
            (3 2 6 7)      
        );
    }
    
    symmetry
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)     
        );
    }
    
    outlet
    {
       type cyclic;
       neighbourPatch  inlet;
        faces
        (
            (1 2 6 5)        
        );
    }
    
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
        );
    }    
);

mergePatchPairs
(
);

// ************************************************************************* //
