rheoTool/tutorials/rheoEFoam/channelEDF/PowerLaw/PoissonBoltzmann/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{                
                type            PowerLaw;

                rho             rho [1 -3 0 0 0 0 0] 1000;
  
                etaMin          etaMin [1 -1 -1 0 0 0 0] 1e-20; 
    		etaMax          etaMax [1 -1 -1 0 0 0 0] 1e8; 
   		k               k [1 -1 -1 0 0 0 0] 0.001; 
   		n               n [ 0 0 0 0 0 0 0 ] 0.75;      
}

passiveScalarProperties
{
                solvePassiveScalar   no;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

// ************************************************************************* //
